In [1]:
#Feb 18 2023
#https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.select_dtypes.html
#https://pandas.pydata.org/docs/getting_started/comparison/comparison_with_sql.html
#https://pandas.pydata.org/docs/getting_started/comparison/comparison_with_spreadsheets.html

In [2]:
#import libraries

import pandas as pd
import numpy as np

In [3]:
#create a data frame
cdf = pd.DataFrame({'Name':['John','Raj','Khan'],'Id':[4,5,6]})
print(cdf)
print("Rows n Columns:",len(cdf),len(cdf.columns))

   Name  Id
0  John   4
1   Raj   5
2  Khan   6
Rows n Columns: 3 2

In [4]:
df = pd.read_csv(r'/Users/hemendra/Downloads/orders.csv',header=0)
df.head(3)

,OrderNumber,ClientName,ProductName,ProductType,UnitPrice,ProductQuantity,TotalPrice,Currency,DeliveryAddress,DeliveryCity,DeliveryPostcode,DeliveryCountry,DeliveryContactNumber,PaymentType,PaymentBillingCode,PaymentDate
0,PO0060504-1,MacGyver Inc,Piano,Keyboard,4700,3,14100,GBP,72 Academy Street,Swindon,SN4 9QP,United Kingdom,+44 7911 843910,Debit,PO0060504-20210321,21/03/2021
1,PO0060504-2,Howell LLC,Bamboo Flute,Woodwind,60,1,60,GBP,91 Buckingham Rd,Grimsby,DN37 9TS,UNITED KINGDOM,+44 151 496 0566,Credit,PO0087294-20210317,17/03/2021
2,PO0060504-3,HOWELL LLC,Harp,String,940,2,1880,GBP,91 Buckingham Rd,Grimsby,DN37 9TS,UNITED KINGDOM,+44 151 496 0566,Credit,PO0087294-20210317,17/03/2021

In [5]:
#data frame summary
print("df size",df.size, "\nRows n Columns:",len(df),len(df.columns))

print(df.index)
print("rows and columns:",df.shape)

df size 416
Rows n Columns: 26 16
RangeIndex(start=0, stop=26, step=1)
rows and columns: (26, 16)

In [6]:
#get column names
column_names = df.columns
print("Length of the columns:", len(column_names))
print(column_names)

Length of the columns: 16
Index(['OrderNumber', 'ClientName', 'ProductName', 'ProductType', 'UnitPrice',
       'ProductQuantity', 'TotalPrice', 'Currency', 'DeliveryAddress',
       'DeliveryCity', 'DeliveryPostcode', 'DeliveryCountry',
       'DeliveryContactNumber', 'PaymentType', 'PaymentBillingCode',
       'PaymentDate'],
      dtype='object')

In [7]:
#data type of columns
print(df.dtypes)

OrderNumber              object
ClientName               object
ProductName              object
ProductType              object
UnitPrice                 int64
ProductQuantity           int64
TotalPrice                int64
Currency                 object
DeliveryAddress          object
DeliveryCity             object
DeliveryPostcode         object
DeliveryCountry          object
DeliveryContactNumber    object
PaymentType              object
PaymentBillingCode       object
PaymentDate              object
dtype: object

In [8]:
df.at[0,'ClientName']

'MacGyver Inc'

In [9]:
df.loc[0:5,'ClientName']

0    MacGyver Inc
1      Howell LLC
2      HOWELL LLC
3      HOWELL LLC
4      Howell LLC
5     Padberg Inc
Name: ClientName, dtype: object

In [10]:
df.loc[0:3,{'ClientName','ProductName'}]

    ProductName    ClientName
0         Piano  MacGyver Inc
1  Bamboo Flute    Howell LLC
2          Harp    HOWELL LLC
3         Piano    HOWELL LLC

In [11]:
intcolms = df.select_dtypes('int64')
intcolms.head(3)

   UnitPrice  ProductQuantity  TotalPrice
0       4700                3       14100
1         60                1          60
2        940                2        1880

In [12]:
splitdf = df[{'OrderNumber','ClientName', 'ProductName', 'ProductType'}]
splitdf.head(3)

    ProductName ProductType    ClientName  OrderNumber
0         Piano    Keyboard  MacGyver Inc  PO0060504-1
1  Bamboo Flute    Woodwind    Howell LLC  PO0060504-2
2          Harp      String    HOWELL LLC  PO0060504-3

In [13]:
#unique values of a column
splitdf.ClientName.unique()

array(['MacGyver Inc', 'Howell LLC', 'HOWELL LLC', 'Padberg Inc',
       'Russel Turner Limited', 'Quitzon, Luettgen and Waters',
       'Stanton - Reilly', 'Rath - Schroeder', 'Gleason, Rau and Spinka',
       'Zemlak LTD', 'ZEMLAK LTD'], dtype=object)

In [14]:
#Feb 19
df.get(['OrderNumber','ProductName','ProductType','ClientName']).head(3)
#print(len(df), len(df.columns))

   OrderNumber   ProductName ProductType    ClientName
0  PO0060504-1         Piano    Keyboard  MacGyver Inc
1  PO0060504-2  Bamboo Flute    Woodwind    Howell LLC
2  PO0060504-3          Harp      String    HOWELL LLC

In [15]:
#splitdf.where(splitdf['ClientName'] =='MacGyver Inc')

In [16]:
splitdf.groupby("ClientName").size()

ClientName
Gleason, Rau and Spinka         4
HOWELL LLC                      2
Howell LLC                      2
MacGyver Inc                    1
Padberg Inc                     4
Quitzon, Luettgen and Waters    2
Rath - Schroeder                3
Russel Turner Limited           1
Stanton - Reilly                3
ZEMLAK LTD                      3
Zemlak LTD                      1
dtype: int64

In [17]:
#Append in Pandas

dfj1 = pd.DataFrame({'Name':['John','Raj','Khan'],'Id':[4,5,6]})
dfj2 = pd.DataFrame({'Name':['Jane','Raju','Khani'],'Id':[14,25,36]})

joindf = dfj1.append(dfj2)
joindf.head(10)

    Name  Id
0   John   4
1    Raj   5
2   Khan   6
0   Jane  14
1   Raju  25
2  Khani  36

In [18]:
#Inner Join

dfj1 = pd.DataFrame({'Name':['John','Raj','Khan'],'EmpId':[4,5,6]})
dfj2 = pd.DataFrame({'Manger':['Jane','Raju','Khani'],'EmpId':[4,5,6]})

joindf = dfj1.merge(dfj2,on ='EmpId', how='inner')
joindf.head(10)

   Name  EmpId Manger
0  John      4   Jane
1   Raj      5   Raju
2  Khan      6  Khani

In [19]:
#Right Join

dfj1 = pd.DataFrame({'Name':['John','Raj','Khan'],'EmpId':[4,5,10]})
dfj2 = pd.DataFrame({'Manger':['Jane','Raju','Khani'],'EmpId':[4,5,6]})

joindf = dfj1.merge(dfj2,on ='EmpId', how='right')
joindf.head(10)

   Name  EmpId Manger
0  John      4   Jane
1   Raj      5   Raju
2   NaN      6  Khani

In [20]:
#Left Join

dfj1 = pd.DataFrame({'Name':['John','Raj','Khan'],'EmpId':[4,5,10]})
dfj2 = pd.DataFrame({'Manger':['Jane','Raju','Khani'],'EmpId':[4,5,6]})

joindf = dfj1.merge(dfj2,on ='EmpId', how='left')
joindf.head(10)

   Name  EmpId Manger
0  John      4   Jane
1   Raj      5   Raju
2  Khan     10    NaN

In [21]:
#outer Join

dfj1 = pd.DataFrame({'Name':['John','Raj','Khan'],'EmpId':[4,5,10]})
dfj2 = pd.DataFrame({'Manger':['Jane','Raju','Khani'],'EmpId':[4,5,6]})

joindf = dfj1.merge(dfj2,on ='EmpId', how='outer')
joindf.head(10)

   Name  EmpId Manger
0  John      4   Jane
1   Raj      5   Raju
2  Khan     10    NaN
3   NaN      6  Khani